import {useState} from "react";

function FooterText() {

  const [Status, setStatus] = useState(false)

  function showText(){
    setStatus(!Status)
  }

  return (
    <div className="w-3/5 h-fit max-md:w-full max-md:mt-14 max-md:mb-4" dir="rtl">
      <h1 className="text-lg mb-4">باسلام؛یه بازار بی مرز و پر از زندگی!</h1>
      <div className={` ${Status?"" : "line-clamp-4 "}  w-fit text-gray-600`}>
        <p>
          یه بازار بزرگ و شلوغ رو تصور کن که به جای خیابون و مغازه، تو گوشی یا
          لپ‌تاپت باشه. باسلام دقیقا همین حس رو بهت می‌ده! یه بازار اینترنتی
          بی‌مرز که می‌تونی از هر گوشه ایران خرید کنی و دم در خونه تحویل بگیری
          یا محصولاتت رو به تمام ایران بفروشی. این‌جا همه‌چی پیدا می‌شه؛ از
          خوراکی‌های خوشمزه گرفته تا لباس، صنایع دستی، لوازم دیجیتال و حتی
          مبلمان و سرویس خواب و وسایل آشپزخونه. فرقی نمی‌کنه دنبال چیزای خاص
          باشی یا چیزای روزمره، این‌جا دست خالی نمی‌مونی! باسلام همون بازاره! یه
          بازار اینترنتی که مستقیم تو رو به فروشنده‌های واقعی وصل می‌کنه.
        </p>
        <h1 className="text-black my-4">یه بازار مردمی</h1>
        <p>
          تفاوت باسلام با خیلی از سایت‌ها و بازارهای آنلاین دیگه اینه که این‌جا
          مستقیم با فروشنده‌ها در ارتباطی. اگه سوالی درباره محصول داری، راحت از
          خود تولید کننده یا فروشنده می‌پرسی. حتی می‌تونی نظرات خریدارهای قبلی
          رو بخونی و مطمئن‌تر خرید کنی. می‌بینی؟ انگار تو یه بازار واقعی داری
          قدم می‌زنی، گپ می‌زنی و خرید می‌کنی.
        </p>
        <h1 className="text-black my-4">یه بازار مردمی</h1>
        <p>
          این‌جا یه دنیای بزرگه! هر چیزی که نیاز داری رو می‌تونی راحت پیدا کنی:
        </p>
        <h1 className="text-black my-4">یه بازار مردمی</h1>
        <p>
          دنبال مواد غذایی هستی؟ تو باسلام همه چی هست! برنج، حبوبات، ماکارونی،
          انواع ترشی، مربا، عسل و نوشیدنی‌های مختلف. حتی غذاهای آماده و
          نیمه‌آماده هم این‌جا منتظرته. اگه به دنبال طعم‌های خاص ایرانی مثل
          زعفران، زرشک، رب یا لبنیات و چاشنی‌های خفن باشی، شک نکن دست خالی
          نمی‌ری.
        </p>
        <h1 className="text-black my-4">یه بازار مردمی</h1>
        <p>
          اگه اهل خرید لباس باشی، باسلام پر از تنوعه. از لباس‌های زنونه و مردونه
          گرفته تا لباس‌های دخترونه، پسرونه و حتی نوزادی. هر سلیقه‌ای که داشته
          باشی، این‌جا چیزی پیدا می‌کنی که مناسبته.
        </p>
      </div>
      <div className="mt-2 text-blue-600 text-sm"><span className="cursor-pointer" onClick={showText}>
        {
          Status? "نمایش کمتر"
          : "نمایش بیشتر"
        }
        <i className={`fa-solid   ${
          Status? 'fa-arrow-up'
          : 'fa-arrow-down'
        }   mr-3`}></i></span></div>
    </div>
  );
}

export default FooterText;
